zephyrproject-rtos/zephyr/drivers/display/display_stm32_ltdc.c
/*
 * Copyright (c) 2022 Byte-Lab d.o.o. <dev@byte-lab.com>
 * Copyright 2023 NXP
 * Copyright (c) 2024 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_ltdc

#include <string.h>
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <stm32_ll_rcc.h>
#include <zephyr/drivers/display.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/linker/devicetree_regions.h>
#include <zephyr/pm/device.h>
#include <zephyr/sys/barrier.h>
#include <zephyr/cache.h>
#if defined(CONFIG_STM32_LTDC_FB_USE_SHARED_MULTI_HEAP)
#include <zephyr/multi_heap/shared_multi_heap.h>
#endif

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(display_stm32_ltdc, CONFIG_DISPLAY_LOG_LEVEL);

/* Horizontal synchronization pulse polarity */
#define LTDC_HSPOL_ACTIVE_LOW     0x00000000
#define LTDC_HSPOL_ACTIVE_HIGH    0x80000000

/* Vertical synchronization pulse polarity */
#define LTDC_VSPOL_ACTIVE_LOW     0x00000000
#define LTDC_VSPOL_ACTIVE_HIGH    0x40000000

/* Data enable pulse polarity */
#define LTDC_DEPOL_ACTIVE_LOW     0x00000000
#define LTDC_DEPOL_ACTIVE_HIGH    0x20000000

/* Pixel clock polarity */
#define LTDC_PCPOL_ACTIVE_LOW     0x00000000
#define LTDC_PCPOL_ACTIVE_HIGH    0x10000000

#if CONFIG_STM32_LTDC_ARGB8888
#define STM32_LTDC_INIT_PIXEL_FORMAT	LTDC_PIXEL_FORMAT_ARGB8888
#define DISPLAY_INIT_PIXEL_FORMAT	PIXEL_FORMAT_ARGB_8888
#elif CONFIG_STM32_LTDC_RGB888
#define STM32_LTDC_INIT_PIXEL_FORMAT	LTDC_PIXEL_FORMAT_RGB888
#define DISPLAY_INIT_PIXEL_FORMAT	PIXEL_FORMAT_RGB_888
#elif CONFIG_STM32_LTDC_RGB565
#define STM32_LTDC_INIT_PIXEL_FORMAT	LTDC_PIXEL_FORMAT_RGB565
#define DISPLAY_INIT_PIXEL_FORMAT	PIXEL_FORMAT_RGB_565
#else
#error "Invalid LTDC pixel format chosen"
#endif

/* The YUV to RGB converter is described by the HAL of the series that carry it */
#if defined(LTDC_YUV2RGBCONVERTOR_BT601_REDUCED_RANGE)
#define STM32_LTDC_HAS_YUV 1
#endif

#define STM32_LTDC_INIT_PIXEL_SIZE	DISPLAY_BITS_PER_PIXEL(DISPLAY_INIT_PIXEL_FORMAT) \
					/ BITS_PER_BYTE

struct stm32_ltdc_cb_data {
	const struct device *dev;
	display_event_cb_t cb_fn;
	void *user_data;
	uint32_t event_mask;
	bool in_isr;
	uint32_t out_reg_handle;
	uint32_t user_line_number;
};

struct display_stm32_ltdc_data {
	LTDC_HandleTypeDef hltdc;
	enum display_pixel_format current_pixel_format;
	uint8_t current_pixel_size;
	uint8_t *frame_buffer;
	uint32_t frame_buffer_len;
	const uint8_t *pend_buf;
	const uint8_t *front_buf;
	struct k_sem sem;
	struct k_sem cb_sem;
	struct stm32_ltdc_cb_data cb;
};

struct display_stm32_ltdc_config {
	uint32_t width;
	uint32_t height;
	struct gpio_dt_spec disp_on_gpio;
	struct gpio_dt_spec bl_ctrl_gpio;
	const struct stm32_pclken *pclken;
	size_t pclk_len;
	const struct reset_dt_spec reset;
	const struct pinctrl_dev_config *pctrl;
	void (*irq_config_func)(const struct device *dev);
	const struct device *display_controller;
};

static void stm32_ltdc_global_isr(const struct device *dev)
{
	struct display_stm32_ltdc_data *data = dev->data;
	uint32_t current_line_number = data->hltdc.Instance->CPSR & 0xFFFF;
	bool event_handled = false;

	struct display_event_data event_data = {
		.timestamp = k_cycle_get_64(),
		.info.line = current_line_number,
	};

	if (!__HAL_LTDC_GET_FLAG(&data->hltdc, LTDC_FLAG_LI) &&
	    __HAL_LTDC_GET_IT_SOURCE(&data->hltdc, LTDC_IT_LI)) {
		return;
	}

	if (current_line_number == 0) {
		/* VSync event occurs at the beginning of the frame, line number = 0 */

		/* Set next interrupt in case the user has programmed a line event */
		HAL_LTDC_ProgramLineEvent(&data->hltdc, data->cb.user_line_number);

		k_sem_take(&data->cb_sem, K_NO_WAIT);

		if ((data->cb.dev != NULL) &&
			(data->cb.event_mask & DISPLAY_EVENT_VSYNC)) {
			event_handled = data->cb.cb_fn(data->cb.dev,
				DISPLAY_EVENT_VSYNC, &event_data, data->cb.user_data);
		}

		k_sem_give(&data->cb_sem);

		if (!event_handled) {
			if (data->front_buf != data->pend_buf) {
				data->front_buf = data->pend_buf;

				LTDC_LAYER(&data->hltdc, LTDC_LAYER_1)->CFBAR =
					(uint32_t)data->front_buf;

				__HAL_LTDC_RELOAD_IMMEDIATE_CONFIG(&data->hltdc);

				k_sem_give(&data->sem);
			}
		}

		__HAL_LTDC_CLEAR_FLAG(&data->hltdc, LTDC_FLAG_LI);
		return;
	}

	k_sem_take(&data->cb_sem, K_NO_WAIT);

	if ((data->cb.dev != NULL) &&
		(data->cb.event_mask & DISPLAY_EVENT_LINE_INT)) {
		/*
		 * There is no need to check event_handled return value
		 * It is only intended for VSYNC
		 */
		data->cb.cb_fn(data->cb.dev, DISPLAY_EVENT_LINE_INT, &event_data,
			data->cb.user_data);

		/* Check if the user configured a new line event in the cb: */
		uint32_t current_int_line = data->hltdc.Instance->LIPCR;

		if (current_int_line != current_line_number) {
			data->cb.user_line_number = current_int_line;
			/*
			 * Check if the new line number has been passed or not.
			 * If it has been passed, it should be called after VSYNC
			 */
			if (current_int_line > current_line_number) {
				HAL_LTDC_ProgramLineEvent(&data->hltdc, current_int_line);
			} else {
				HAL_LTDC_ProgramLineEvent(&data->hltdc, 0);
			}
		}
	}

	k_sem_give(&data->cb_sem);

	__HAL_LTDC_CLEAR_FLAG(&data->hltdc, LTDC_FLAG_LI);
}

/*
 * The controller converts to RGB during scanout, which costs the processor
 * nothing. Only the packed 4:2:2 order is offered: erratum ES0620, section
 * 2.7.1, says the planar YUV420 modes do not work.
 */
static int stm32_ltdc_set_yuv(const struct device *dev)
{
#if defined(STM32_LTDC_HAS_YUV)
	struct display_stm32_ltdc_data *data = dev->data;
	LTDC_LayerFlexYUVCoPlanarTypeDef cfg = {0};
	const struct display_stm32_ltdc_config *config = dev->config;

	/* An odd width would split a pair of pixels across two lines */
	if ((config->width % 2U) != 0U) {
		return -EINVAL;
	}

	cfg.Layer.WindowX0 = data->hltdc.LayerCfg[0].WindowX0;
	cfg.Layer.WindowX1 = data->hltdc.LayerCfg[0].WindowX1;
	cfg.Layer.WindowY0 = data->hltdc.LayerCfg[0].WindowY0;
	cfg.Layer.WindowY1 = data->hltdc.LayerCfg[0].WindowY1;
	cfg.Layer.Alpha = data->hltdc.LayerCfg[0].Alpha;
	cfg.Layer.Alpha0 = data->hltdc.LayerCfg[0].Alpha0;
	cfg.Layer.BlendingFactor1 = data->hltdc.LayerCfg[0].BlendingFactor1;
	cfg.Layer.BlendingFactor2 = data->hltdc.LayerCfg[0].BlendingFactor2;
	cfg.Layer.ImageWidth = config->width;
	cfg.Layer.ImageHeight = config->height;
	cfg.FlexYUV.YUVOrder = LTDC_YUV_ORDER_LUMINANCE_FIRST;
	cfg.FlexYUV.LuminanceOrder = LTDC_YUV_LUMINANCE_ORDER_EVEN_FIRST;
	cfg.FlexYUV.ChrominanceOrder = LTDC_YUV_CHROMIANCE_ORDER_U_FIRST;
	cfg.FlexYUV.LuminanceRescale = LTDC_YUV_LUMINANCE_RESCALE_ENABLE;
	cfg.YUVAddress = (uint32_t)data->front_buf;
	cfg.ColorConverter = LTDC_YUV2RGBCONVERTOR_BT601_REDUCED_RANGE;

	/* The layer cannot be reconfigured while the controller is scanning */
	__HAL_LTDC_DISABLE(&data->hltdc);
	if (HAL_LTDC_ConfigLayerFlexYUVCoPlanar(&data->hltdc, &cfg, LTDC_LAYER_1) != HAL_OK) {
		__HAL_LTDC_ENABLE(&data->hltdc);
		return -EIO;
	}
	__HAL_LTDC_ENABLE(&data->hltdc);

