zephyrproject-rtos/zephyr/drivers/display/display_stm32_ltdc.c
	return 0;
#else
	ARG_UNUSED(dev);

	return -ENOTSUP;
#endif /* STM32_LTDC_HAS_YUV */
}

static int stm32_ltdc_set_pixel_format(const struct device *dev,
				const enum display_pixel_format format)
{
	struct display_stm32_ltdc_data *data = dev->data;
	HAL_StatusTypeDef hal_ret;
	uint32_t ltdc_pix_fmt;

	if (IS_ENABLED(STM32_LTDC_HAS_YUV) && format == PIXEL_FORMAT_YUYV) {
		int ret = stm32_ltdc_set_yuv(dev);

		if (ret != 0) {
			return ret;
		}

		data->current_pixel_format = format;
		data->current_pixel_size =
			DISPLAY_BITS_PER_PIXEL(format) / BITS_PER_BYTE;

		return 0;
	}

	if (format == PIXEL_FORMAT_RGB_565) {
		ltdc_pix_fmt = LTDC_PIXEL_FORMAT_RGB565;
	} else if (format == PIXEL_FORMAT_RGB_888) {
		ltdc_pix_fmt = LTDC_PIXEL_FORMAT_RGB888;
	} else if (format == PIXEL_FORMAT_ARGB_8888) {
		ltdc_pix_fmt = LTDC_PIXEL_FORMAT_ARGB8888;
	} else {
		return -ENOTSUP;
	}

	hal_ret = HAL_LTDC_SetPixelFormat(&data->hltdc, ltdc_pix_fmt, 0);
	if (hal_ret != HAL_OK) {
		return -EIO;
	}

	data->current_pixel_format = format;
	data->current_pixel_size =
		DISPLAY_BITS_PER_PIXEL(data->current_pixel_format) / BITS_PER_BYTE;

	return 0;
}

static int stm32_ltdc_set_orientation(const struct device *dev,
				const enum display_orientation orientation)
{
	ARG_UNUSED(dev);

	if (orientation == DISPLAY_ORIENTATION_NORMAL) {
		return 0;
	}

	return -ENOTSUP;
}

static void stm32_ltdc_get_capabilities(const struct device *dev,
				struct display_capabilities *capabilities)
{
	struct display_stm32_ltdc_data *data = dev->data;

	memset(capabilities, 0, sizeof(struct display_capabilities));

	capabilities->x_resolution = data->hltdc.LayerCfg[0].WindowX1 -
				     data->hltdc.LayerCfg[0].WindowX0;
	capabilities->y_resolution = data->hltdc.LayerCfg[0].WindowY1 -
				     data->hltdc.LayerCfg[0].WindowY0;
	capabilities->supported_pixel_formats = PIXEL_FORMAT_ARGB_8888 |
					PIXEL_FORMAT_RGB_888 |
					PIXEL_FORMAT_RGB_565 |
					(IS_ENABLED(STM32_LTDC_HAS_YUV) ? PIXEL_FORMAT_YUYV : 0);
	capabilities->screen_info = 0;

	capabilities->current_pixel_format = data->current_pixel_format;
	capabilities->current_orientation = DISPLAY_ORIENTATION_NORMAL;
	capabilities->supported_events = DISPLAY_EVENT_VSYNC | DISPLAY_EVENT_LINE_INT;
}

static void stm32_ltdc_partial_write(const struct device *dev,
				     const uint16_t x, const uint16_t y,
				     const struct display_buffer_descriptor *desc,
				     uint8_t *dst, const uint8_t *src)
{
	const struct display_stm32_ltdc_config *config = dev->config;
	struct display_stm32_ltdc_data *data = dev->data;

	dst += x * data->current_pixel_size;
	dst += y * config->width * data->current_pixel_size;

	for (uint16_t row = 0; row < desc->height; row++) {
		(void)memcpy(dst, src, desc->width * data->current_pixel_size);
		sys_cache_data_flush_range(dst, desc->width * data->current_pixel_size);
		dst += config->width * data->current_pixel_size;
		src += desc->pitch * data->current_pixel_size;
	}
}

/*
 * Set pend_buf as the next buffer to be used by the LTDC then enable
 * LINE interrupt so that the irq handler can swap the buffer.
 * Wait for the end of the swap by waiting for the semaphore given by
 * the irq handler upon LTDC register update
 *
 * NOTE: MUST only be called when switching between two different buffers,
 * front_buf and pend_buf, where front_buf != pend_buf. Otherwise, it
 * will lead to a deadlock.
 */
static void stm32_ltdc_sync_frame(struct display_stm32_ltdc_data *data, const uint8_t *pend_buf)
{
	__ASSERT(data->front_buf != pend_buf, "Buffers must be different");

	k_sem_reset(&data->sem);

	data->pend_buf = pend_buf;

	__HAL_LTDC_CLEAR_FLAG(&data->hltdc, LTDC_FLAG_LI);
	__HAL_LTDC_ENABLE_IT(&data->hltdc, LTDC_IT_LI);

	k_sem_take(&data->sem, K_FOREVER);

	if (data->cb.dev == NULL) {
		__HAL_LTDC_DISABLE_IT(&data->hltdc, LTDC_IT_LI);
	}
}

static int stm32_ltdc_write(const struct device *dev, const uint16_t x,
				const uint16_t y,
				const struct display_buffer_descriptor *desc,
				const void *buf)
{
	const struct display_stm32_ltdc_config *config = dev->config;
	struct display_stm32_ltdc_data *data = dev->data;
	uint8_t *dst = NULL;

	/* Validate the given parameters */
	if (x + desc->width > config->width || y + desc->height > config->height) {
		LOG_ERR("Rectangle does not fit into the display");
		return -EINVAL;
	}

	/*
	 * A pair of pixels shares its chrominance, so a rectangle that starts
	 * or ends inside one would pair every luminance with the wrong half.
	 */
	if (IS_ENABLED(STM32_LTDC_HAS_YUV) &&
	    data->current_pixel_format == PIXEL_FORMAT_YUYV &&
	    ((x | desc->width) & 1U) != 0U) {
		LOG_ERR("Packed YUV rectangles start and end on even columns");
		return -EINVAL;
	}

	/* Use buf as ltdc frame buffer directly if it has length same as ltdc frame buffer. */
	if ((x == 0) && (y == 0) &&
	    (desc->width == config->width) &&
	    (desc->height == config->height) &&
	    (desc->pitch == desc->width)) {
		sys_cache_data_flush_range((void *)buf, config->height * config->width *
					   data->current_pixel_size);

		/* Avoid waiting for a frame sync when the active buffer is unchanged. */
		if (buf != data->front_buf) {
			stm32_ltdc_sync_frame(data, buf);
		}

		return 0;
	}

	/* Partial write is only possible if LTDC has its own framebuffer */
	if (CONFIG_STM32_LTDC_FB_NUM == 0) {
		LOG_ERR("Partial write requires internal frame buffer");
		return -ENOTSUP;
	}

	dst = data->frame_buffer;

	if (CONFIG_STM32_LTDC_FB_NUM == 2) {
		/*
		 * In case of having more than 1 framebuffer, copy is done on the one at the back
		 * (not being displayed). At the end, buffers are swapped
		 */
		if (data->front_buf == data->frame_buffer) {
			dst = data->frame_buffer + data->frame_buffer_len;
		}

		/* Copy front buffer content to back then overwrite it */
		memcpy(dst, data->front_buf, data->frame_buffer_len);

		stm32_ltdc_partial_write(dev, x, y, desc, dst, buf);

		sys_cache_data_flush_range(dst, config->height * config->width *
						data->current_pixel_size);

		stm32_ltdc_sync_frame(data, dst);
	} else {
		stm32_ltdc_partial_write(dev, x, y, desc, dst, buf);
	}

