zephyrproject-rtos/zephyr/drivers/display/display_stm32_ltdc.c
	return 0;
}

static int stm32_ltdc_read(const struct device *dev, const uint16_t x,
				const uint16_t y,
				const struct display_buffer_descriptor *desc,
				void *buf)
{
	const struct display_stm32_ltdc_config *config = dev->config;
	struct display_stm32_ltdc_data *data = dev->data;
	uint8_t *dst = buf;
	const uint8_t *src = data->front_buf;
	uint16_t row;

	/* Validate the given parameters */
	if (x + desc->width > config->width || y + desc->height > config->height) {
		LOG_ERR("Rectangle does not fit into the display");
		return -EINVAL;
	}

	/* src = pointer to upper left pixel of the rectangle to be read from frame buffer */
	src += (x * data->current_pixel_size);
	src += (y * config->width * data->current_pixel_size);

	for (row = 0; row < desc->height; row++) {
		(void)memcpy(dst, src, desc->width * data->current_pixel_size);
		sys_cache_data_flush_range(dst, desc->width * data->current_pixel_size);
		src += (config->width * data->current_pixel_size);
		dst += (desc->pitch * data->current_pixel_size);
	}

	return 0;
}

static void *stm32_ltdc_get_framebuffer(const struct device *dev)
{
	struct display_stm32_ltdc_data *data = dev->data;

	return ((void *)data->front_buf);
}

static int stm32_ltdc_display_blanking_off(const struct device *dev)
{
	const struct display_stm32_ltdc_config *config = dev->config;
	const struct device *display_dev = config->display_controller;
	int err;

	if (!display_dev && !config->bl_ctrl_gpio.port) {
		return -ENOSYS;
	}

	/* Turn on backlight (if its GPIO is defined in device tree) */
	if (config->bl_ctrl_gpio.port) {
		err = gpio_pin_set_dt(&config->bl_ctrl_gpio, 1);
		if (err < 0) {
			return err;
		}
	}

	/* Panel controller's phandle is not passed to LTDC in devicetree */
	if (!display_dev) {
		return 0;
	}

	if (!device_is_ready(display_dev)) {
		LOG_ERR("Display device %s not ready", display_dev->name);
		return -ENODEV;
	}

	return display_blanking_off(display_dev);
}

static int stm32_ltdc_display_blanking_on(const struct device *dev)
{
	const struct display_stm32_ltdc_config *config = dev->config;
	const struct device *display_dev = config->display_controller;
	int err;

	if (!display_dev && !config->bl_ctrl_gpio.port) {
		return -ENOSYS;
	}

	/* Turn off backlight (if its GPIO is defined in device tree) */
	if (config->bl_ctrl_gpio.port) {
		err = gpio_pin_set_dt(&config->bl_ctrl_gpio, 0);
		if (err < 0) {
			return err;
		}
	}

	/* Panel controller's phandle is not passed to LTDC in devicetree */
	if (!display_dev) {
		return 0;
	}

	if (!device_is_ready(display_dev)) {
		LOG_ERR("Display device %s not ready", display_dev->name);
		return -ENODEV;
	}

	return display_blanking_on(display_dev);
}

static int stm32_ltdc_display_register_event_cb(const struct device *dev, display_event_cb_t cb,
	void *user_data, uint32_t event_mask, bool in_isr, uint32_t *out_reg_handle)
{
	struct display_stm32_ltdc_data *data = dev->data;

	if (out_reg_handle == NULL) {
		LOG_ERR("Registration failed: output handle pointer is NULL");
		return -EINVAL;
	}
	if (data->cb.dev != NULL) {
		LOG_ERR("Registration failed: a callback is already registered");
		return -EBUSY;
	}
	if (!in_isr) {
		LOG_ERR("Registration failed: only ISR context is supported for this driver");
		return -ENOSYS;
	}

	/* VSync can only be detected by LTDC line interrupt,
	 * so the line event is programmed accordingly
	 */
	if (event_mask & DISPLAY_EVENT_VSYNC) {
		HAL_LTDC_ProgramLineEvent(&data->hltdc, 0);
	}

	*out_reg_handle = 1U;

	data->cb.dev = dev;
	data->cb.cb_fn = cb;
	data->cb.user_data = user_data;
	data->cb.event_mask = event_mask;
	data->cb.in_isr = in_isr;
	data->cb.out_reg_handle = *out_reg_handle;

	/*
	 * Set user_line_number if a line interrupt has already been set up,
	 * and program it if it is before VSYNC
	 */
	if (data->hltdc.Instance->LIPCR != 0 &&
	    data->hltdc.Instance->LIPCR < data->hltdc.Init.TotalHeigh) {
		data->cb.user_line_number = data->hltdc.Instance->LIPCR;
	} else {
		data->cb.user_line_number = 0;
	}

	if (data->cb.user_line_number > (data->hltdc.Instance->CPSR & 0xFFFF)) {
		HAL_LTDC_ProgramLineEvent(&data->hltdc, data->cb.user_line_number);
	}

	return 0;
}

static int stm32_ltdc_display_unregister_event_cb(const struct device *dev, uint32_t reg_handle)
{
	struct display_stm32_ltdc_data *data = dev->data;

	k_sem_take(&data->cb_sem, K_FOREVER);

	if (data->cb.dev != dev) {
		LOG_ERR("Unregistration failed: device does not match");
		k_sem_give(&data->cb_sem);
		return -EINVAL;
	}
	if (reg_handle != 1U) {
		LOG_ERR("Unregistration failed: invalid registration handle");
		k_sem_give(&data->cb_sem);
		return -EINVAL;
	}

	memset(&data->cb, 0, sizeof(data->cb));

	k_sem_give(&data->cb_sem);

	return 0;
}

/* This symbol takes the value 1 if one of the device instances */
/* is configured in dts with a domain clock */
#if STM32_DT_INST_DEV_DOMAIN_CLOCK_SUPPORT
#define STM32_LTDC_DOMAIN_CLOCK_SUPPORT 1
#else
#define STM32_LTDC_DOMAIN_CLOCK_SUPPORT 0
#endif

static int stm32_ltdc_init(const struct device *dev)
{
	int err;
	const struct display_stm32_ltdc_config *config = dev->config;
	struct display_stm32_ltdc_data *data = dev->data;

	/* Configure and set display on/off GPIO */
	if (config->disp_on_gpio.port) {
		err = gpio_pin_configure_dt(&config->disp_on_gpio, GPIO_OUTPUT_ACTIVE);
		if (err < 0) {
			LOG_ERR("Configuration of display on/off control GPIO failed");
			return err;
		}
	}

	/* Configure and set display backlight control GPIO */
	if (config->bl_ctrl_gpio.port) {
		err = gpio_pin_configure_dt(&config->bl_ctrl_gpio, GPIO_OUTPUT_INACTIVE);
		if (err < 0) {
			LOG_ERR("Configuration of display backlight control GPIO failed");
			return err;
		}
	}

	/* Configure DT provided pins */
	if (!IS_ENABLED(CONFIG_MIPI_DSI)) {
		err = pinctrl_apply_state(config->pctrl, PINCTRL_STATE_DEFAULT);
		if (err < 0) {
			LOG_ERR("LTDC pinctrl setup failed");
			return err;
		}
	}

	/* Turn on LTDC peripheral clock */
	err = clock_control_on(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
				(clock_control_subsys_t) &config->pclken[0]);
	if (err < 0) {
		LOG_ERR("Could not enable LTDC peripheral clock");
		return err;
	}

	if (IS_ENABLED(STM32_LTDC_DOMAIN_CLOCK_SUPPORT) && (config->pclk_len > 1)) {
		/* Enable LTDC clock source */
		err = clock_control_configure(DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE),
					      (clock_control_subsys_t) &config->pclken[1],
					      NULL);
		if (err < 0) {
			LOG_ERR("Could not configure LTDC peripheral clock");
			return err;
		}
	}

